# Outline Constructor (XYZ, XYZ) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Outline Constructor (XYZ, XYZ)
Outline Class See Also
---
Constructor that uses a minimum and maximum XYZ point to initialize the outline.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public Outline(
	XYZ minimumPoint,
	XYZ maximumPoint
)
```

Visual Basic
---
```text
Public Sub New ( _
	minimumPoint As XYZ, _
	maximumPoint As XYZ _
)
```

Visual C++
---
```text
public:
Outline(
	XYZ^ minimumPoint,
	XYZ^ maximumPoint
)
```

# ### Parameters
minimumPoint
    Type: Autodesk.Revit.DB..::..XYZ The minimum point
maximumPoint
    Type: Autodesk.Revit.DB..::..XYZ The maximum point.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Outline Class
Outline Overload
Autodesk.Revit.DB Namespace